<h2>ยินดีต้อนรับ</h2>

<p>
Smart Inventory คือ แอปพลิเคชั่น ที่พัฒนาขึ้นบนเว็บ หรือที่เราเรียกกันว่า เว็บแอปพลิเคชั่น ซึ่งในเอกสารนี่จะเรียก Smart Inventory สั้นๆ ว่า SI  <br>
SI  ถูกพัฒนาขึ้นมาเพื่อใช้ในการบริหารจัดการคลังสินค้าและการขายในแบบ Bussiness to bussiness (ผู้ผลิต กับ ตัวแทนขาย) ซึ่งระบบได้แบ่งการทำงานเป็น 2 ส่วนหลัก ได้แก่ Back-end และ Sale-page <br><br>
ในส่วนแรกคือส่วนของ Back-end จะเป็นในเรื่องของการบริหารจัดการคลังสินค้าและการจัดการคำสั่งซื้อต่างๆ เช่น การรับสินค้าเข้าคลัง, การจัดเตรียมสินค้า, การตรวจสินค้า, การรับคำสั่งซื้อจากลูกค้า รวมถึงการกำหนด Master ต่างๆก็จะอยู่ในส่วนของ Back-end ซึ่งการเข้าถึงแต่ละเมนูจะถูกจัดการโดยการกำหนดสิทธิ์การเข้าถึง <br><br>
ส่วนที่สอง คือ Sale-page เป็นเครื่องมือในการขายของพนักงานขาย โดยพนักงานขายจะสามารถสั่งซื้อสินค้าให้ลูกค้าและเห็นสต็อกคงเหลือของสินค้า
</p>
