<h1>ปรับปรุงยอดสินค้า</h1>
<p>
การปรับปรุงยอดสินค้า จะกระทำเมื่อยอดสินค้าในระบบไม่ตรงกับยอดสินค้าจริง เพื่อให้การทำงานเป็นไปด้วยความถูกต้องหากมีความต่างของยอดสินค้าในคลังเกิดขึ้นควรปรับปรุงยอดสินค้าให้ตรงกับสินค้าจริง ซึ่งท่านสามารถดึงยอดต่างของสินค้าแต่ละโซนที่เราได้บันทึกไว้ในตอนตรวจนับสินค้า(เปรียบเทียยยอด) เพื่อนำมาปรับปรุงยอดสินค้า วิธีการมีดังนี้
</p>
<p>
<img class="pic" src="images/invent/2.2.9.png" /><br />
1. ที่เมนูหลัก เลือกเมนู คลังสินค้า > ปรับปรุงยอด<br />
<img class="pic" src="images/invent/2.3.0.png" /><br />
2. คลิกปุ่ม เพิ่ม เพื่อเพิ่มเอกสารปรับปรุงยอด<br />
<img class="pic" src="images/invent/2.3.1.png" /><br />
3. ใส่ข้อมูลอ้างอิง (ถ้ามี) <br />
4. ระบุวันที่ โดยคลิกที่ช่องวันที่ แล้วเลือกจากปฏิทิน<br />
5. ใส่หมายเหตุ(ถ้ามี)<br />
6. คลิกปุ่ม บันทึก เพื่อบันทึกเอกสาร<br />
<h2>เพิ่มรายการทีละรายการ</h2>
<img class="pic" src="images/invent/2.3.2.png" /><br />
7. เลือกคลังสินค้าที่จะทำงานด้วย เนื่องจากเอกสารสามารถปรับปรุงยอดข้ามคลังได้ การเพิ่มรายการลงเอกสารแต่ละรายการต้องระบุคลังสินค้าที่จะปรับปรุงด้วย<br />
8. ยิงบาร์โค้ดสินค้าที่จะปรับยอด<br />
9. ยิงบาร์โค้ดโซนในช่อง บาร์โค้ดโซน หรือ พิมพ์ชื่อโซนในช่อง ชื่อโซน โดยโซนที่ระบุต้องเป็นโซนที่อยู่ในคลังที่เลือกในขั้นตอนที่ 7<br /> 
10. ระบุจำนวน ในช่องเพิ่ม/ลด เช่นต้องการปรับยอดเพิ่มขึ้น 10 ชิ้น ให้ใส่เลข 10 ในช่องเพิ่ม และ ใส่เลข 0 ในช่องลด และทำกลับกันหากต้องการปรับยอดลดลง<br />
11. คลิกปุม OK เพื่อเพิ่มรายการลงเอกสาร<br />
<img class="pic" src="images/invent/2.3.3.png" /><br />
12. รายการปรับยอดถูกเพิ่มเข้าไปในเอกสาร ท่านสามารถทำซ้ำขั้นตอนที่ 7 - 11 จนกว่าจะได้รายการที่ต้องการปรับยอดครบตามที่ต้องการ<br />
13. เมื่อได้รายการที่จะปรับยอดครบแล้วคลิกปุ่ม ปรับยอดเพื่อดำเนินการปรับปรุงยอดสินค้า ระบบจะทำการปรับปรุงยอดสินค้าตามโซนและจำนวนที่เราระบุลงไป เป็นอันจบการปรับปรุงยอดสินค้า<br />

<h2>เพิ่มรายการ โดยดึงจากยอดต่างที่บันทึกไว้ตอนตรวจนับสินค้า</h2>
<img class="pic" src="images/invent/2.3.4.png" /><br />
7. คลิกปุ่มโหลด เพื่อโหลดยอดต่าง<br />
<img class="pic" src="images/invent/2.3.5.png" /><br />
8. เลือกรายการที่ต้องการจากรายการยอดต่างที่บันทึกไว้ โดยติ๊กช่องว่างท้ายรายการในบรรทัดเดียวกันกับรายการสินค้าที่เราเลือก หรือ หากต้องการเลือกทุกรายการ ให้ติ๊กช่องว่าง บนสุดเพื่อเลือกทั้งหมด หรือ ไม่เลือกทั้งหมด<br />
9. คลิกปุ่ม โหลด อีกครั้ง ระบบจะดึงรายการที่เลือกไว้เพิ่มเข้าไปในเอกสาร<br />
<img class="pic" src="images/invent/2.3.6.png" /><br />
10. ท่านสามารถทำซ้ำขั้นตอนที่ 7 - 11 ในหัวข้อ "เพิ่มทีละรายการ" หรือ ขั้นตอนที่ 7 - 9 ในหัวข้อ "เพิ่มรายการ โดยดึงจากยอดต่างที่บันทึกไว้ตอนตรวจนับสินค้า" เพื่อเพิ่มรายการอื่นๆจนครบตามที่ต้องการ แล้วจึงปุ่ม "ปรับยอด" เพื่อให้ระบบดำเนินการปรับยอดสินค้า เป็นอันจบการปรับปรุงยอดสินค้า<br />


</p>


<h2></h2>
<p style="width:100%; text-align:center">
หัวข้อก่อนหน้า : <a href="index.php?content=check_zone">ตรวจนับสินค้า(เปรียบเทียบยอด)</a>&nbsp;&nbsp; | &nbsp;&nbsp;  <a href="#top">ขึ้นบน</a>&nbsp;&nbsp; | &nbsp;&nbsp; หัวข้อถัดไป : <a href="index.php?content=warehouse">เพิ่ม/แก้ไข คลังสินค้า</a>
</p>