<h1>การเปิดบิล</h1>
<p>
ขั้นตอนสุดท้ายในการทำงานของระบบออเดอร์คือ การเปิดบิล ในการจัดสินค้า จำนวนสินค้าถูกตัดออกจากโซนแล้วย้ายมาอยู่ที่ Buffer แต่ยังไม่ถูกตัดออกจากคลังสินค้า แต่เมื่อเราเปิดบิล ถ้าเป็นออเดอร์ประเภท ขาย, เบิก, ยืม, หรือ สปอนเซอร์ ระบบจะทำการตัดยอดสินค้าออกจากคลังแล้วทำการบันทึกยอดขาย แต่หากเป็นออเดอร์ประเภท ฝากขาย เมื่อเปิดบิล ระบบจะตัดยอดจากคลัง แล้วย้ายสินค้าไปเพิ่มในคลังฝากขายในโซนที่เรากำหนดไว้ การเปิดบิลมีขั้นตอนง่ายๆดังนี้
 <br />
<img class="pic" src="images/invent/2.8.6.png" /><br />
<img class="pic" src="images/invent/2.8.7.png" /><br />
<img class="pic" src="images/invent/2.8.8.png" /><br />
<img class="pic" src="images/invent/2.8.9.png" /><br />
เมื่อเปิดบิลแล้วออเดอร์นี้จะหายไปจากรายการออเดอร์รอเปิดบิล แต่จะไปปรากฏอยู่ที่ ราการออเดอร์ที่เปิดบิลแล้ว ในเมนู ออเดอร์ > รายการเปิดบิลแล้ว แทน
</p>

<h2></h2>
<p style="width:100%; text-align:center">
หัวข้อก่อนหน้า : <a href="index.php?content=qc">การตรวจสินค้า</a>&nbsp;&nbsp; | &nbsp;&nbsp;  <a href="#top">ขึ้นบน</a>&nbsp;&nbsp; | &nbsp;&nbsp; หัวข้อถัดไป : <a href="index.php?content=sponsor">สปอนเซอร์</a>
</p>