<h1>เพิ่ม/แก้ไข หมวดหมู่สินค้า</h1>
<p>
เพื่อให้การเลือกสินค้า การออกรายงาน การสั่งซื้อสินค้า หรือ การให้ส่วนลดสินค้าแก่ลูกค้า เป็นไปได้ง่ายขึ้น เราควรแบ่งสินค้าออกเป็นหมวดหมู่ที่ชัดเจนตามลักษณะของสินค้า หรือ กลุ่มสินค้า ระบบมีหมวดหมู่เริ่มต้นมาให้ 1 หมวดหมู่ คือ HOME ซึ่งหมวดหมู่ที่สร้างขึ้นมาใหม่ จะอยู่ภายใต้หมวดหมู่นี้ และเราสามารถเพิ่มหมวดหมู่ใหม่ได้ไม่จำกัดจำนวน แต่จะสามารถเพิ่มได้สูงสุด 4 ระดับ 
</p>
<p>
<img class="pic" src="images/invent/category_chart.png"  />
</p>
<p>
สิ่งที่เราต้องทำคือเพิ่มหมวดหมู่ระดับที่ 1 ก่อน ซึ่งจะอยู่ภายใต้หมวดหมู่ HOME ที่เป็นหมวดหมู่ระดับบนสุด (ระดับ 0) หลังจากนั้นจึงเพิ่มหมวดหมู่ระดับที่ 2 โดยการกำหนดหมวดหมู่หลักเป็นหมวดหมู่ระดับที่ 1 และทำเหมือนเดิม ในระดับที่ 3 และ 4 
</p>
<p>
<img class="pic" src="images/invent/1.3.5.png"  /> <br />
<img class="pic" src="images/invent/1.3.6.png"  /> <br />
<img class="pic" src="images/invent/1.3.7.png"  /> <br />
<img class="pic" src="images/invent/1.3.8.png"  /> <br />
<img class="pic" src="images/invent/1.3.9.png"  /> <br />
</p>
<p>&nbsp;</p>

<h2></h2>
<p style="width:100%; text-align:center">
หัวข้อก่อนหน้า : <a href="index.php?content=attribute">เพิ่ม/แก้ไข คุณลักษณะ</a>&nbsp;&nbsp; | &nbsp;&nbsp;  <a href="#top">ขึ้นบน</a>&nbsp;&nbsp; | &nbsp;&nbsp; หัวข้อถัดไป : <a href="index.php?content=product">เพิ่ม/แก้ไข สินค้า</a>
</p>