<h1>การตรวจนับสินค้า(เปรียบเทียบยอด)</h1>
<p>
เมื่อระบบมีการใช้งานไปช่วงระยะเวลาหนึ่ง อาจมีความคลาดเคลื่อนที่เกิดขึ้นจากใช้งานระบบ ท่านอาจต้องนับสต็อกเพื่อปรับยอดสินค้าในระบบให้ตรงกับสินค้าจริง ซึ่งในหัวข้อนี้ท่านสามารถตรวจนับสินค้าโดยไม่ต้องหยุดกิจกรรมต่างๆได้ ซึ่งหลักการของการตรวจนับสินค้าเพื่อเปรียบเทียบยอดนี้ คือ ท่านเข้าไปนับสินค้าที่มีอยู่ในแต่ละโซนและบันทึกยอดที่ตรวจนับได้ หากยอดตรวจนับจริงกับยอดในระบบต่างกัน ระบบจะทำการบันทึกยอดต่างเก็บไว้ และสามารถดึงยอดต่างที่เก็บไว้ไปเปิดเอกสารปรับยอดสินค้าเพื่อปรับปรุงยอดสินค้าให้ตรงกับสินค้าจริง โดยวิธีการใช้งานมีดังนี้
</p>
<p>
<img class="pic" src="images/invent/2.2.2.png" /><br />
<img class="pic" src="images/invent/2.2.3.png" /><br />
<img class="pic" src="images/invent/2.2.4.png" /><br />
<img class="pic" src="images/invent/2.2.5.png" /><br />
<img class="pic" src="images/invent/2.2.6.png" /><br />
<img class="pic" src="images/invent/2.2.7.png" /><br />
<img class="pic" src="images/invent/2.2.8.png" /><br />




</p>


<h2></h2>
<p style="width:100%; text-align:center">
หัวข้อก่อนหน้า : <a href="index.php?content=transfer">การโอนสินค้าระหว่างคลัง</a>&nbsp;&nbsp; | &nbsp;&nbsp;  <a href="#top">ขึ้นบน</a>&nbsp;&nbsp; | &nbsp;&nbsp; หัวข้อถัดไป : <a href="index.php?content=adjust">ปรับปรุงยอดสินค้า</a>
</p>