<h1>เพิ่ม/แก้ไข สี</h1>
<p>
สินค้าแต่ละตัวจะมีคุณลักษณะต่างๆ เช่น สี ไซด์ ความกว้าง ความยาว ความสูง เป็นต้น แต่ด้วยระบบถูกออกแบบมาเพื่อใช้กับเสื้อผ้าโดยเฉพาะ จึงมีคุณลักษณะสำคัญหลักๆ อยู่ 2 อย่างคือ สี และ ไซด์  ที่เหลือจะอยู่ในส่วนคุณลักษณะอื่นๆ แต่ สี จะมีความพิเศษอีกอย่างคือจะมีกลุ่มสีเพื่อใช้สำหรับแยกแยะเวลาต้องการรายงานการวิเคราะห์เพราะว่า สินค้า 1 รายการมีได้มากกว่า 1 สี <br />
สำหรับการเริ่มต้นระบบใหม่ เราจะต้องทำการ กำหนดกลุ่มสีไว้ก่อน เพราะในขั้นตอนการเพิ่มสี เราจะต้องระบุกลุ่มสีให้กับสีที่เพิ่มเข้าไปใหม่ การเพิ่มกลุ่มสีและการเพิ่มสีทำได้ดังนี้
</p>

<h2>เพิ่ม กลุ่มสี</h2>
<p>
<img class="pic" src="images/invent/1.2.3.png"  /> <br />
<img class="pic" src="images/invent/1.2.4.png"  /> <br />
</p>
<h2>เพิ่ม สี</h2>
<img class="pic" src="images/invent/1.2.5.png"  /> <br />
<img class="pic" src="images/invent/1.2.6.png"  /> <br />
<img class="pic" src="images/invent/1.2.7.png"  /> <br />
<p>&nbsp;</p>

<h2></h2>
<p style="width:100%; text-align:center">
หัวข้อก่อนหน้า : <a href="index.php?content=zone">เพิ่ม/แก้ไข โซนสินค้า</a>&nbsp;&nbsp; | &nbsp;&nbsp;  <a href="#top">ขึ้นบน</a>&nbsp;&nbsp; | &nbsp;&nbsp; หัวข้อถัดไป : <a href="index.php?content=size">เพิ่ม/แก้ไข ไซด์</a>
</p>