<h1>เพิ่ม/แก้ไข กลุ่มลูกค้า</h1>
<p>
ระบบกำหนดให้ลูกค้าถูกแบ่งออกเป็นกลุ่มเพื่ออำนวยความสะดวกในการเรียกดูยอดขาย ซึ่งเราสามารถแบ่งกลุ่มลูกค้าได้หลากหลายเท่าที่ต้องการเช่น แบ่งตามเขตการขาย แบ่งตามพนักงานขาย แบ่งตามพื้นที่ หรือแบ่งตามเกรดลูกค้าก็ได้
เมื่อมีการกำหนดกลุ่มให้กับลูกค้าแล้ว เราจะสามารถนำข้อมูลที่เชื่อมโยงกันมาวิเคราะห์ได้ ซึ่งหลักการแบ่งกลุ่มก็ขึ้นอยู่กับนโยบายของแต่ละบริษัท  ขั้นตอนการเพิ่มกลุ่มลูกค้ามีดังนี้
</p>

<p>
<img class="pic" src="images/invent/1.5.9.png"  /> <br />
<img class="pic" src="images/invent/1.6.0.png"  /> <br />
<img class="pic" src="images/invent/1.6.1.png"  /> <br />
</p>

<h2></h2>
<p style="width:100%; text-align:center">
หัวข้อก่อนหน้า : <a href="index.php?content=product">เพิ่ม/แก้ไข สินค้า</a>&nbsp;&nbsp; | &nbsp;&nbsp;  <a href="#top">ขึ้นบน</a>&nbsp;&nbsp; | &nbsp;&nbsp; หัวข้อถัดไป : <a href="index.php?content=customer">เพิ่ม/แก้ไข ลูกค้า</a>
</p>