<h1>เพิ่ม/แก้ไข ลูกค้า</h1>
<p>

</p>

<p>
<img class="pic" src="images/invent/1.6.2.png"  /> <br />
<img class="pic" src="images/invent/1.6.3.png"  /> <br />
<img class="pic" src="images/invent/1.6.4.png"  /> <br />
3. เลือกคำนำหน้า <br />
4. กำหนดรหัสลูกค้า
5. ใส่ชื่อลูกค้า <span style="color:red;">(จำเป็นต้องใส่)</span><br />
6. ใส่นามสกุลลูกค้า <span style="color:red;">(จำเป็นต้องใส่)</span><br />
7. ใส่ชื่อร้านหรือบริษัท<br />
8. ใส่ อีเมล์ของลูกค้า ซึ่งอีเมล์นี้ ลูกค้า จะใช้ในการเข้าระบบเพื่อสั่งสินค้าเอง หากลูกค้าไม่ได้สั่งสินค้าเองไม่ต้องใส่ก็ได้ แต่ถ้าลูกค้าต้องการเข้าระบบเพื่อสั่งสินค้าเอง จำเป็นต้องระบุอีเมล์และรหัสผ่าน<br />
9. ใส่ รหัสผ่าน ที่ลูกค้า จะใช้ในการเข้าระบบเพื่อสั่งสินค้าเอง หากลูกค้าไม่ได้สั่งสินค้าเองไม่ต้องใส่ก็ได้ แต่ถ้าลูกค้าต้องการเข้าระบบเพื่อสั่งสินค้าเอง จำเป็นต้องระบุอีเมล์ และรหัสผ่าน<br />
10. ระบุวันเกิดของลูกค้า<br />
11. กำหนด วงเงินเครดิต  ซึ่งวงเงินเครดิต คือ มูลค่าสูงสุดที่เราอนุญาติให้ลูกค้านี้ซื้อสินค้าโดยยังไม่ชำระเงินได้  และเมื่อมีการสั่งสินค้าแล้วยังไม่ได้ชำระเงินยอดคงเหลือเครดิตจะลดลงตามยอดสั่งซื้อและเมื่อยอดคงเหลือหมดลูกค้าจะไม่สามารถสั่งสินค้าได้ วงเงินคงเหลือจะเพิ่มขึ้นตามจำนวนเงินที่ลูกค้าชำระเงินค่าสินค้า<br />
12. กำหนด เครดิตเทอม<br />
13. กำหนดสถานะของลูกค้า หากสถานะเป็นปิด ลูกค้าจะไม่สามารถเข้าระบบเพื่อสั่งสินค้าได้<br />
<img class="pic" src="images/invent/1.6.5.png"  /> <br />
14. กำหนดกลุ่มลูกค้าให้กับลูกค้า โดยลูกค้า 1 รายสามารถอยู่ได้มากกว่า 1 กลุ่ม<br />
15. กำหนดกลุ่มหลักให้ลูกค้า<br />
16. เลือกพนักงานขายที่จะได้คอมมิชชั่นเมื่อลูกค้ารายนี้ซื้อสินค้า<br />
<img class="pic" src="images/invent/1.6.6.png"  /> <br />

</p>

<h2></h2>
<p style="width:100%; text-align:center">
หัวข้อก่อนหน้า : <a href="index.php?content=customer_group">เพิ่ม/แก้ไข กลุ่มลูกค้า</a>&nbsp;&nbsp; | &nbsp;&nbsp;  <a href="#top">ขึ้นบน</a>&nbsp;&nbsp; | &nbsp;&nbsp; หัวข้อถัดไป : <a href="index.php?content=setting">เพิ่ม/แก้ไข กำหนดค่าต่างๆ</a>
</p>