<h1>การยืมสินค้าและการคืนสินค้า</h1>
<p>
การยืมสินค้า หมายถึง การนำสินค้าออกจากคลังโดยไม่เกิดยอดขายและนำกลับมาคืนเพื่อขายต่อไป ซึ่งการยืมสินค้าก็มีหลายกรณี เช่น ยืมเพื่อเป็นตัวอย่าง ยืมเพื่อไปแสดงในร้าน หรือ ยืมเพื่อใช้ถ่ายแบบ เป็นต้น เมื่อมีการยืม ก็ต้องมีการคืน เอกสารตัวนี้จะสิ้นสุดกระบวนการเมื่อมีการคืนสินค้าครบตามจำนวนที่ยืมไป ขั้นตอนการยืมสินค้า และ การคืนสินค้า สามารถดูได้จากรูปภาพและคำบรรยายด้านล่างนี้
</p>
<h2>การยืมสินค้า</h2>
<p>
<img class="pic" src="images/invent/1.9.3.png" /><br />
1. ที่เมนูหลัก เลือกเมนู คลังสินค้า -> ยืมสินค้า<br />
<img class="pic" src="images/invent/1.9.4.png" /><br />
2. คลิกปุ่ม ยืมสินค้า<br />
<img class="pic" src="images/invent/1.9.5.png" /><br />
3. กำหนดวันที่ยืมสินค้า โดยคลิกที่ช่องวันที่แล้วเลือกวันที่จากปฏิทิน<br />
4. กำนหดผู้ยืมสินค้า โดยพิมพ์ชื่อแล้วเลือกจากรายชื่อที่ปรากฏขึ้นมา หากไม่มีรายชื่อที่ต้องการปรากฏขี้นมา แสดงว่าไม่มีพนักงานนี้อยู่ในระบบ ให้ทำการเพิ่มพนักงานที่เมนู กำหนดค่า ->พนักงาน แล้วจึงกลับมาทำต่อ <a href="index.php?content=employee" target="_blank">คลิกเพื่อดูวิธีการเพิ่มพนักงาน</a><br />
5. ใส่หมายเหตุการยืม(ถ้ามี)<br />
6. คลิกปุ่มเพิ่ม เพื่อเพิ่มเอกสารการยืมสินค้า<br />
<img class="pic" src="images/invent/1.9.6.png" /><br />
7. ระบบจะแบ่งสินค้าไว้เป็น แท็บตามหมวดหมู่ คลิกเลือกหมวดหมู่สินค้าที่ต้องการยืม<br />
8. คลิกเลือกสินค้าที่ต้องการยืมที่รูปสินค้า<br />
<img class="pic" src="images/invent/1.9.7.png" /><br />
<img class="pic" src="images/invent/1.9.8.png" /><br />
9. หลังจากคลิกรูปสินค้าระบบจะดึงข้อมูลสินค้าและยอดสินค้าคงเหลือมาแสดงในรูปแบบตาราง ให้ท่านใส่จำนวนที่ต้องการในช่องจำนวนซึ่งสามารถใส่ได้สูงสุดไม่เกินจำนวนที่ปรากฏอยู่ใต้ช่องใส่จำนวน(จำนวนสต็อกคงเหลือ) โดยใส่เฉพาะรายการที่ต้องการหากรายการไหนไม่ต้องการไม่จำเป็นต้องใส่<br />
10. คลิกปุ่ม เพิ่มในรายการเพื่อเพิ่มรายการที่เลือกลงในเอกสาร<br />
<img class="pic" src="images/invent/1.9.9.png" /><br />
11. ทำซ้ำขั้นตอนที่ 7 - 10 จนกว่าจะได้สินค้าที่ต้องการจนครบ จากนั้นคลิกปุ่มบันทึกด้านบนเพื่อบันทึกเอกสาร<br />
12. เมื่อบันทึกเอกสารแล้ว จะกลายเป็นออเดอร์รอจัดสินค้าเพื่อให้เจ้าหน้าที่คลังสินค้าดำเนินการจัดสินค้า และ ตรวจสินค้าต่อไป ผู้ยืมสามารถรับสินค้าได้เมื่อมีการจัดสินค้า ตรวจสินค้า และเปิดบิลเรียบร้อยแล้ว<br />
</p>
<h2>การคืนสินค้า</h2>
<p>
<img class="pic" src="images/invent/1.9.3.png" /><br />
1. ที่เมนูหลัก เลือกเมนู คลังสินค้า -> ยืมสินค้า<br />
<img class="pic" src="images/invent/2.0.0.png" /><br />
2. คลิกปุ่ม คืนสินค้า<br />
<img class="pic" src="images/invent/2.0.1.png" /><br />
3. ค้นหารายการที่จะคืน โดยใส่เงื่อนไขที่จะค้นหาตามช่องที่กำหนด เช่น ใส่เลขที่เอกสารในช่องเลขที่เอกสารเพื่อค้นหาตามเลขที่เอกสาร หรือ เลือกวันที่จากปฏิทินในช่องวันที่เพื่อค้นหาตามวันที่เอกสาร หรือ พิมพ์ชื่อผู้ยืมแล้วเลือกจากรายชื่อเพื่อค้นหาตามชื่อผู้ยืม<br />
4. คลิกปุ่ม ค้นหา เพื่อทำการค้นหาตามเงื่อนไขที่ระบุ<br />
<img class="pic" src="images/invent/2.0.2.png" /><br />
5. เมื่อพบรายการที่ค้นหาตามเงื่อนไขแล้ว ทำการคลิกรายการที่ต้องการคืน<br />
<img class="pic" src="images/invent/2.0.3.png" /><br />
6. ใส่จำนวนที่ต้องการคืน โดยระบบจะมีตัวเลขจำนวนตามยอดที่ยืมไปเพื่ออำนวยความสะดวกหากตัวเลขไม่ตรงกับที่จะคืนให้แก้ไข รายการไหนยังไม่มียอดให้ใส่ 0 <br />
7. คลิกปุ่ม คืนสินค้าเพื่อบันทึก<br /><br />
<span style="color:red; font-size:large;">*** เมื่อมีการคืนสินค้า ยอดสินค้าที่รับคืนกลับมาจะอยู่ใน "โซนยกเลิก" เจ้าหน้าที่คลังสินค้า จำเป็นต้องย้ายสินค้าเข้าโซนปกติเพื่อให้ฝ่ายขายสามารถมองเห็นและสั่งสินค้าได้ต่อไป</span> <a href="index.php?content=move_zone" target="_blank">คลิกทีนี่เพื่อดูวิธีการย้ายพื้นที่จัดเก็บสินค้า</a><br />
</p>


<h2></h2>
<p style="width:100%; text-align:center">
หัวข้อก่อนหน้า : <a href="index.php?content=requisition">การเบิกสินค้า</a>&nbsp;&nbsp; | &nbsp;&nbsp;  <a href="#top">ขึ้นบน</a>&nbsp;&nbsp; | &nbsp;&nbsp; หัวข้อถัดไป : <a href="index.php?content=move_zone">การย้ายพื้นที่จัดเก็บ</a>
</p>