<h1>การย้ายพื้นที่จัดเก็บ</h1>
<p>
การย้ายพื้นที่จัดเก็บ คือการย้ายสินค้าจากโซนหนี่งไปยังอีกโซนหนึ่ง เพื่อความสะดวกในการจัดการสินค้า เช่น รับเข้าสินค้าหลายรายการเข้าโซนใดโซนหนึ่ง แล้วจึงย้ายเข้าโซนต่างๆเพื่อความรวดเร็วในการรับสินค้าเข้าเป็นต้น  
สิ่งที่เกิดขึ้นเมื่อเราทำการย้ายสินค้าก็คือ สินค้าถูกตัดออกจากโซนที่อยู่เดิมแล้วถูกเพิ่มเข้าไปใน "โซนกำลังย้าย" จากนั้นจึงย้ายจากโซนกำลังย้ายเข้าโซนปลายทาง สินค้าจะถูกตัดออกจากโซนกำลังย้ายไปเข้าโซนปลายทาง <span style="color:red; "><u>ซึ่งการย้ายพื้นที่จัดเก็บนี้ โซนต้นทางและโซนปลายทาง ต้องอยู่ในคลังเดียวกัน ไม่สามารถย้ายข้ามคลังได้ </u></span>  &nbsp;(หากต้องการย้ายข้ามคลัง <a href="index.php?content=transfer" target="_blank">คลิกเพื่อดูการย้ายสินค้าระหว่างคลัง</a>) การย้ายพื้นที่จัดเก็บสินค้า ทำได้ดังนี้
</p>
<p>
<img class="pic" src="images/invent/2.0.4.png" /><br />
1. ที่หน้าหลักเลือเมนู คลังสินค้า -> ย้ายพื้นที่จัดเก็บ<br />
<img class="pic" src="images/invent/2.0.5.png" /><br />
2. พิมพ์ชื่อโซนต้นทางที่ต้องการย้ายสินค้าออกแล้วคลิกตกลง หรือ ยิงบาร์โค้ดโซนต้นทางที่ต้องการย้ายสินค้าออก<br />
<img class="pic" src="images/invent/2.0.6.png" /><br />
3. ใส่จำนวนสินค้าที่ต้องการย้ายออก ซึ่งจำนวนต้องมากกว่า 0 และต้องไม่เกินจำนวนสินค้าที่มีอยู่ในโซนนั้น<br />
4. ยิงบาร์โค้ดสินค้าที่ต้องการย้าย เมื่อยิงบาร์โค้ดแล้วสังเกตุจำนวนสินค้าในโซนเฉพาะรายการที่ยิงบาร์โค้ดจะมีการเปลี่ยนแปลง<br />
<img class="pic" src="images/invent/2.0.7.png" /><br />
5. ถึงขั้นตอนนี้ ยอดสินค้าจะถูกตัดออกจากโซนต้นทาง ไปอยู่ใน โซนกำลังย้าย ท่านสามารถย้ายสินค้าตัวอื่นออกจากโซนต้นทางอื่นๆ โดยคลิกที่ปุ่มโซนใหม่แล้วทำซ้ำขั้นตอนที่ 2 - 4 ได้จนกว่าจะได้สินค้าที่จะย้ายออกครบ ซึ่งเราสามารถดูว่าสินค้าอะไรอยู่ในโซนกำลังย้ายได้โดยการคลิกที่ปุ่ม สินค้ากำลังย้าย จะแสดงรายการสินค้าทุกรายการที่อยู่ในโซนกำลังย้าย <br />
<img class="pic" src="images/invent/2.0.8.png" /><br />
6. หน้านี้จะแสดงรายการสินค้าที่อยู่ในโซนกำลังย้าย ให้ทำการย้ายเข้าโซนปลายทางโดยการคลิกที่ ไอคอน ย้ายเข้าโซน ในบรรทัดเดียวกับสินค้าที่ต้องการย้ายเข้าโซนปลายทาง ดังภาพด้ายบน<br />
<img class="pic" src="images/invent/2.0.9.png" /><br />
7. ใส่จำนวนสินค้าที่ต้องการย้ายเข้า<br />
8. พิมพ์ชื่อโซนปลายทางที่ต้องการย้ายเข้าแล้วคลิกปุ่มย้าย หรือ ยิงบาร์โค้ดโซน<br />
<img class="pic" src="images/invent/2.1.0.png" /><br />
9. ระบบจะทำการย้ายสินค้าออกจากโซนกำลังย้าย แล้ว เพิ่มเข้าไปในโซนปลายทางที่ระบุ เมื่อดำเนินการเสร็จจะมีการแจ้งผลดังภาพ<br />
</p>


<h2></h2>
<p style="width:100%; text-align:center">
หัวข้อก่อนหน้า : <a href="index.php?content=lend">การยืมและการคืนสินค้า</a>&nbsp;&nbsp; | &nbsp;&nbsp;  <a href="#top">ขึ้นบน</a>&nbsp;&nbsp; | &nbsp;&nbsp; หัวข้อถัดไป : <a href="index.php?content=transfer">การโอนสินค้าระหว่างคลัง</a>
</p>