<h1>ออเดอร์</h1>
<p>
สำหรับออเดอร์ จะมีการทำงานอยู่หลักๆ ดังนี้
<ul>
    <a href="index.php?content=order_add"><li> การเพิ่มออเดอร์</li></a>
    <a href="index.php?content=order_state"><li> การเปลี่ยนสถานะออเดอร์</li></a>
    <a href="index.php?content=order_edit"><li> การจแก้ไขออเดอร์</li></a>
    <a href="index.php?content=order_cancle"><li> การยกเลิกออเดอร์</li></a>
</ul>   
<h2>Flow การไหลของออเดอร์</h2>
<img class="pic" src="images/invent/order_chart.png" /><br />
</p>
<p>
ออเดอร์เกิดขึ้นเมื่อลูกค้าต้องการสินค้า ซึ่งการเพิ่มออเดอร์ในระบบมีได้ด้วยกัน 3 ช่องทางคือ <br />
1. โดย Sale-co, Sale support หรือ เจ้าหน้าที่ทำทำหน้าที่รับออเดอร์จากลูกค้าที่ เป็นคนรับออเดอร์จากลูกค้าแล้วเพิ่มออเดอร์ในระบบ ( Bacl-end )<br />
2. โดย Sale หรือ พนักงานขายที่อยู่นอกบริษัท เป็นคนเพิ่มออเดอร์ โดยจะเพิ่มจากหน้าสั่งสินค้าของพนักงานขายเอง ( Sale page ) <br />
3. โดย ลูกค้า  ลูกค้าสามารถร้องขอให้ทางผู้ดูแลระบบสร้างบัญชีผู้ใช้งานให้แล้วสั่งสินค้าเองผ่านทางหน้าเว็บสำหรับลูกค้า ( Front-end )<br />
แต่เนื้อหาในส่วนนี้จะครอบคลุมแค่ในส่วนของ Back-end เท่านั้น<br />
เมื่อออเดอร์เกิดขึ้นแล้ว ก็จะเข้าสู่กระบวนการเปลี่ยนสถานะของออเดอร์ โดยเริ่มต้นออเดอร์จะได้รับสถานะ "รอการชำระเงิน" เพื่อรอการชำระเงินจากลูกค้า อย่างไรก็ดีเราไม่จำเป็นต้องรอให้ลูกค้าชำระเงิน(กรณีลูกค้าเครดิต) ก็สามารถเปลี่ยนสถานะของออเดอร์ได้  ลำดับต่อไปของการไหลของออเดอร์ คือการจัดสินค้า เพื่อเตรียมสินค้าส่งให้ลูกค้า หลังจากจัดสินค้าเสร็จแล้วระบบจะให้เราตรวจสินค้าที่เราได้จัดมาว่าตรงตามที่ลูกค้าสั่งมาหรือเปล่า เมื่อตรวจเสร็จแล้วจึงเปิดบิลเพื่อจัดส่งสินค้าและตัดยอดสินค้าออกจากคลังสินค้าต่อไป
</p>
<h2></h2>
<p style="width:100%; text-align:center">
<a href="#top">ขึ้นบน</a>&nbsp;&nbsp; | &nbsp;&nbsp; หัวข้อถัดไป : <a href="index.php?content=order_add">การเพิ่มออเดอร์</a>
</p>