<h1>การเปลี่ยนสถานะออเดอร์</h1>
<p>
เมื่อบันทึกออเดอร์เรียบร้อยแล้ว ขั้นตอนต่อไปการเปลี่ยนสถานะของออเดอร์ โดยสถานะของออเดอร์จะมีด้วยกัน หลายสถานะ ได้แก่<br />
<ul>
<li> <span style="color:red;">รอการชำระเงิน	: </span> เมื่อออเดอร์ถูกบันทึกออเดอร์จะได้รับสถานะนี้ทันที ซึ่งเราอาจต้องรอการยืนยันการชำระเงินก่อน หรือ อาจไม่ต้อรอการชำระเงินก็ได้ แต่หากออเดอร์ยังอยู่ในสถานะนี้ เจ้าหน้าที่คลังสินค้าจะยังไม่สามารถจัดสินค้าได้ และ ยังสามารถแก้ไขออเดอร์ได้อยู่ สถานะนี้จะถูกเปลี่ยนโดยผู้ที่ดูแลออเดอร์ในหน้าแสดงรายการออเดอร์</li>
<li> <span style="color:red;"> ชำระเงินแล้ว  : </span> ออเดอร์ที่ลูกค้าทำการชำระเงินแล้ว เมื่อลูกค้าชำระเงินแล้วเราต้องมาเปลี่ยนสถานะให้เป็นชำระเงินแล้ว เพื่อปรับปรุงข้อมูลเครดิตของลูกค้า ซึ่งการเปลี่ยนสถานะนี้สามารถเปลี่ยนได้ทั้งก่อนจัดสินค้า และ หลังจัดสินค้า แต่มีเงื่อนไขว่าลูกค้าต้องชำระเงินแล้ว เพราะสถานะนี้จะมีการปรับปรุงข้อมูลยอดค้างชำระและข้อมูลเครดิตคงเหลือของลูกค้า สถานะนี้จะถูกเปลี่ยนโดยผู้ที่ดูแลออเดอร์ในหน้าแสดงรายการออเดอร์</li>
<li>  <span style="color:red;">รอจัดสินค้า : </span> ออเดอร์พร้อมสำหรับให้เจ้าหน้าที่คลังสินค้าจัดสินค้าตามออเดอร์ ซึ่งรายการออเดอร์จะไปปรากฏที่หน้าจัดสินค้าเมื่อออเดอร์ได้รับสถานะนี้ สถานะนี้จะถูกเปลี่ยนโดยผู้ที่ดูแลออเดอร์ในหน้าแสดงรายการออเดอร์</li>
<li> <span style="color:red;"> กำลังจัดสินค้า : </span> ออเดอร์นี้กำลังถูกจัดสินค้าตามออเดอร์อยู่ ออเดอร์จะได้รับสถานะนี้โดยอัตโนมัติ ทันที่ที่เจ้าหน้าที่เริ่มการจัดสินค้าโดยคลิกปุ่ม จัดสินค้า โดยเจ้าหน้าที่จัดสินค้า</li>
<li> <span style="color:red;"> จัดสินค้าแล้ว : </span> รายการสินค้าตามออเดอร์ถูกจัดครบถ้วน หรือ จัดเสร็จ(แต่อาจจะไม่ครบ) แล้ว สถานะนี้จะถูกเพิ่มเข้ามาโดยการคลิกปุ่มจัดเสร็จแล้วหรือปุ่มบังคับจบ โดยคนที่จัดสินค้า และออเดอร์จะไปปรากฏในหน้าตรวจสินค้าเพื่อให้เจ้าหน้าที่ทำการตรวจสินค้าต่อไป</li>
<li> <span style="color:red;"> กำลัง QC : </span> ออเดอร์กำลังถูกเจ้าหน้าที่ตรวจสินค้าอยู่ โดยสถานะนี้จะถูกเพิ่มอัตโนมัติเมื่อมีการคลิกปุ่ม ตรวจสินค้า ในหน้าออเดอร์ตรวจสินค้า</li>
<li> <span style="color:red;"> รอเปิดบิล : </span> ออเดอร์ได้รับการตรวจสินค้าเรียบร้อยแล้วและมีการคลิกปุ่มตรวจเสร็จหรือปุ่มบังคับจบ(กรณีสินค้าไม่ครบ) โดยเจ้าหน้าที่ตรวจสินค้า และออเดอร์จะไปปรากฏอยู่ในหน้า รายการเปิดบิล เพื่อรอเปิดบิลต่อไป </li>
<li> <span style="color:red;">เปิดบิลแล้ว : </span> ออเดอร์ถูกเปิดบิลแล้ว ระบบทำการตัดยอดสินค้าออกจากคลังและทำการบันทึกยอดขาย สถานะนี้จะถูกเพิ่มเข้ามาตอนที่เจ้าหน้าที่คลิกปุ่มเปิดใบกำกับภาษี (ซึ่งปุ่มจะไม่ปรากฏจนกว่าสถานะออเดอร์จะเป็นรอเปิดบิล)</li>
<li> <span style="color:red;"> ยกเลิก : </span> เมื่อมีการเปลี่ยนสถานะมาเป็นสถานะนี้  ไม่ว่ากำลังทำอะไรอยู่กับรายการสินค้าของออเดอร์ที่ถูกยกเลิกนี้ จะทำต่อไม่ได้ หากเปิดบิลแล้ว ระบบจะลบยอดขายออกแล้วคืนยอดสต็อกสินค้ากลับไปไว้ใน โซน ยกเลิกสินค้า เพื่อให้เจ้าหน้าที่ย้ายสินค้ากลับโซนต่อไป</li>
</ul>
การเปลี่ยนสถานะออเดอร์ทำได้ดังนี้<br />
<img class="pic" src="images/invent/2.4.5.png" /><br />
<img class="pic" src="images/invent/2.4.6.png" /><br />
<img class="pic" src="images/invent/2.4.7.png" /><br />


</p>


<h2></h2>
<p style="width:100%; text-align:center">
หัวข้อก่อนหน้า : <a href="index.php?content=order_add">เพิ่มออเดอร์ใหม่</a>&nbsp;&nbsp; | &nbsp;&nbsp;  <a href="#top">ขึ้นบน</a>&nbsp;&nbsp; | &nbsp;&nbsp; หัวข้อถัดไป : <a href="index.php?content=order_edit">แก้ไขออเดอร์</a>
</p>