<h1>การยกเลิกออเดอร์</h1>
<p>
เมื่อมีการยกเลิกออเดอร์ จะไม่สามารถเพิ่มหรือลดจำนวนหรือรายการสินค้าได้ หากกำลังจัดสินค้าอยู่จะไม่สามารถจัดต่อได้ หากกำลังตรวจสินค้าอยู่จะไม่สามารถตรวจต่อได้ และหากออเดอร์อยู่ในรายการรอเปิดบิลออเดอร์จะหายไปจากรายการรอเปิดบิลจะสามารถดูออเดอร์ได้จากรายการในเมนูออเดอร์เท่านั้น และ เมื่อเราทำการยกเลิกออเดอร์ รายการสินค้าที่ถูกจัดแล้วจะถูกคืนไปที่โซน ยกเลิกสินค้า <br />
<img class="pic" src="images/invent/2.4.5.png" /><br />
<img class="pic" src="images/invent/2.7.2.png" /><br />
<img class="pic" src="images/invent/2.7.3.png" /><br />
</p>

<h2></h2>
<p style="width:100%; text-align:center">
หัวข้อก่อนหน้า : <a href="index.php?content=order_edit">การแก้ไขออเดอร์</a>&nbsp;&nbsp; | &nbsp;&nbsp;  <a href="#top">ขึ้นบน</a>&nbsp;&nbsp; | &nbsp;&nbsp; หัวข้อถัดไป : <a href="index.php?content=prepare">การจัดสินค้า</a>
</p>