<h1>การเพิ่มออเดอร์</h1>
<p>
เมื่อลูกค้าโทรมาซื้อสินค้า เราสามารถเปิดเอกสารสั่งสินค้าแล้วรับคำสั่งซื้อลูกค้าได้ทันที ซึ่งระบบจะแสดงยอดสินค้าคงเหลือให้เห็นเพื่อความสะดวกในการตอบคำถามลูกค้า การเพิ่มคำสั่งซื้อทำได้ดังนี้ <br />
<img class="pic" src="images/invent/2.3.7.png" /><br />
<img class="pic" src="images/invent/2.3.8.png" /><br />
<img class="pic" src="images/invent/2.3.9.png" /><br />
3. กำหนดวันที่ โดยคลิกในช่องแล้วเลือกจากปฏิทิน<br />
4. เลือกลูกค้าโดยพิมพ์ชื่อลูกค้าแล้วเลือกจากรายการ<br />
5. หากต้องการดูข้อมูลลูกค้าคลิกปุ่มดูข้อมูล หากไม่ต้องการข้ามขั้นตอนนี้ไปได้<br />
6. เลือกขั้นตอนการชำระเงินของลูกค้า<br />
7. ใส่หมายเหตุสำหรับออเดอร์(ถ้ามี)<br />
8. คลิกปุ่ม บันทึก เพื่อเพิ่มเอกสาร<br />
<img class="pic" src="images/invent/2.4.0.png" /><br />
9. รายการสินค้าถูกแบ่งเป็นหมวดหมู่คลิกที่แถบหมวดหมู่เพื่อแสดงรายการสินค้าในหมวดหมู่นั้นๆ<br />
10. คลิกที่รูปสินค้าที่ต้องการสั่ง<br />
<img class="pic" src="images/invent/2.4.1.png" /><br />
11. ใส่จำนวนในช่องจำนวน ให้ตรงกับ สี และ ไซด์ ของสินค้าที่ต้องการในแต่ละช่อง หากไม่ต้องการให้ปล่อยว่างไว้<br />
12. คลิกเพิ่มในรายการ เพื่อเพิ่มสินค้าที่ใส่จำนวนไว้ในรายการออเดอร์ <br />
<img class="pic" src="images/invent/2.4.2.png" /><br />
เมื่อคลิกเพิ่มในรายการแล้ว รายการสินค้าที่เราใส่จำนวนไว้ในช่องจำนวนจะถูกเพิ่มเข้ามาในตารางด้านล่างตามจำนวนที่เราใส่ไว้ หากไม่ต้องการให้คลิกปุ่มรูปถังขยะเพื่อลบออก <br />
ทำซ้ำขั้นต้อนที่ 9 - 12 จนกว่าจะได้สินค้าครบตามที่ต้องการ<br />
<img class="pic" src="images/invent/2.4.3.png" /><br />
13. เมื่อได้สินค้าครบตามที่ต้องการแล้ว คลิกปุ่ม บันทึก เพื่อบันทึกออเดอร์<br />
<img class="pic" src="images/invent/2.4.4.png" /><br />
<span style="color:red">* การคลิกปุ่มบันทึกเมื่อจบการเพิ่มรายการสินค้าแล้ว จะเป็นการยืนยันว่าออเดอร์ได้สินค้าครบแล้ว และผู้ดูแลออเดอร์จะเห็นออเดอร์ที่เราบันทึกไว้ในรายการออเดอร์</span><br />
<span style="color:red">** หากยังได้สินค้าไม่ครบ หรือ ยังไม่พร้อมยืนยันออเดอร์ อย่าเพิ่งคลิกปุ่ม บันทึก </span><br />
<span style="color:red">*** หากยังไม่ได้คลิกปุ่ม บันทึก สถานะออเดอร์จะเป็น สถานะยังไม่บันทึก(ยังไม่ยืนยันว่าเอา) และ จะไม่สามารถเพิ่มออเดอร์ใหม่ได้ หากออเดอร์ปัจจุบันยังไม่บันทึก</span><br />
<p>&nbsp;</p>
</p>


<h2></h2>
<p style="width:100%; text-align:center">
หัวข้อก่อนหน้า : <a href="index.php?content=order">ออเดอร์</a>&nbsp;&nbsp; | &nbsp;&nbsp;  <a href="#top">ขึ้นบน</a>&nbsp;&nbsp; | &nbsp;&nbsp; หัวข้อถัดไป : <a href="index.php?content=order_state">การเปลี่ยนสถานะออเดอร์</a>
</p>