<h1>กำหนดสิทธิ์</h1>
<p>
การกำหนดสิทธิ์ เป็นการจำกัดการเข้าถึงข้อมูล หรือ จำกัดการใช้งานของผู้ใช้งาน เพื่อป้องกันไม่ให้ผู้ที่ไม่เกี่ยวข้องหรือผู้ที่ไม่รู้
เข้าไปสร้างความเสียหายกับข้อมูลในระบบ เพราะฉนั้นผู้ดูแลระบบจำเป็นต้องกำหนดสิทธิ์การใช้งานของ
ผู้ใช้งานแต่ละคนให้เหมาะสมกับหน้าที่ความรับผิดชอบ เพื่อป้องกันความเสียหายที่อาจเกิดจากความรู้เท่าไม่ถึงการณ์ของผู้ใช้งานระบบ
เช่น พนักงานคลังสินค้าเผลอไปลบข้อมูลสินค้าโดยไม่ได้ตั้งใจ จะส่งผลให้ ไม่สามารถขายสินค้าตัวนั้นได้ เป็นต้น ขั้นตอนการกำหนดสิทธิ์ มีดังนี้
</p>
<p>&nbsp;</p>
<p>
<img src="images/invent/1.0.7.jpg" width="70%" style="margin-top:15px; margin-bottom:15px; border:solid 1px #CCC" /> <br>
<img src="images/invent/1.0.8.jpg" width="70%" style="margin-top:15px; margin-bottom:15px; border:solid 1px #CCC" /> <br>
</p>

<h2></h2>
<p style="width:100%; text-align:center">
หัวข้อก่อนหน้า : <a href="index.php?content=profile">สร้างโปรไฟล์</a>&nbsp;&nbsp; | &nbsp;&nbsp;  <a href="#top">ขึ้นบน</a>&nbsp;&nbsp; | &nbsp;&nbsp; หัวข้อถัดไป : <a href="index.php?content=employee">เพิ่ม/แก้ไข พนักงาน</a>
</p>
