<h1>การจัดสินค้า</h1>
<p>
เมื่อออเดอร์ถูกเปลี่ยนสถานะเป็น "รอจัดสินค้า" ออเดอร์นั้นก็จะมาปรากฏอยู่ในรายการ ออเดอร์รอจัด เพื่อรอให้เจ้าหน้าที่จัดสินค้าต่อไป ซึ่งการจัดสินค้าจะจัดตามรายการที่มีในออเดอร์เท่านั้นและออเดอร์ 1 ออเดอร์ จะถูกจัดโดยเจ้าหน้าที่เพียงคนเดียวเท่านั้นไม่สามารถจัดออเดอร์เดียวพร้อมกัน 2 คนได้ (ยกเว้นกรณีที่ใช้ชื่อ login เดียวกัน) 
 <br />
<img class="pic" src="images/invent/2.7.4.png" /><br />
1. เลือกเมนู ออเดอร์ > จัดสินค้า<br />
<img class="pic" src="images/invent/2.7.5.png" /><br />
2. ที่รายการ ออเดอร์รอจัด คลิกปุ่มจัดสินค้าเพื่อเริ่มจัดสินค้าตามออเดอร์<br />
<img class="pic" src="images/invent/2.7.7.png" /><br />
- ที่รายการสินค้ารอจัด ตรงท้ายรายการแต่ละรายการจะมีรายละเอียดโซนสินค้าที่มีสินค้าอยู่ พร้อมทั้งบอกจำนวนสินค้าที่มีในโซนนั้นด้วย เช่น J3112 : 19 หมายถึง มีสินค้ารายการนี้ อยู่ในโซน J3112 จำนวน 19 ชิ้น<br />
<img class="pic" src="images/invent/2.7.6.png" /><br />
3. ยิงบาร์โค้ดโซน (ดูโซนที่มีสินค้าได้จากรายละเอียดด้านท้ายของแต่ละบรรทัดของรายการสินค้ารอจัด)<br />
4. ใส่จำนวนสินค้าที่จัดออกจากโซน<br />
5. ยิงบาร์โค้ดสินค้าที่จัดออกจากโซน<br />
<img class="pic" src="images/invent/2.7.8.png" /><br />
6. คลิกปุ่มเปลี่ยนโซน (หากสินค้าตัวต่อไปที่จะจัดอยู่คนละโซนกับโซนที่เลือกปัจจุบัน) จากนั้น ทำซ้ำขั้นตอนที่ 3 - 5 จนกว่าจะจัดสินค้าครบทุกรายการ<br />
<img class="pic" src="images/invent/2.7.9.png" /><br />
7. เมื่อจัดสินค้าจนครบทุกรายการแล้ว จะมีปุ่ม จัดเสร็จแล้ว ปรากฏขึ้นมา ให้คลิกปุ่มจัดเสร็จแล้ว ระบบจะเปลี่ยนสถานะออเดอร์เป็นจัดเสร็จแล้วเป็นอันเสร็จสิ้นการจัดสินค้า<br />
<img class="pic" src="images/invent/2.8.0.png" /><br />
- กรณีที่จัดสินค้าเสร็จแล้ว แต่ได้รายการสินค้าไม่ครบตามออเดอร์ ให้เราติ๊กถูกที่ช่อง สินค้าไม่ครบ จะมีปุ่ม บังคับจบ ปรากฏขึ้นมา ให้คลิกปุ่มบังคับจบ ระบบจะเปลี่ยนสถานะออเดอร์เป็นจัดเสร็จแล้ว เป็นอันเสร็จสิ้นการจัดสินค้า<br />


</p>

<h2></h2>
<p style="width:100%; text-align:center">
หัวข้อก่อนหน้า : <a href="index.php?content=order_cancle">การยกเลิกออเดอร์</a>&nbsp;&nbsp; | &nbsp;&nbsp;  <a href="#top">ขึ้นบน</a>&nbsp;&nbsp; | &nbsp;&nbsp; หัวข้อถัดไป : <a href="index.php?content=qc">การตรวจสินค้า</a>
</p>