<h1>เพิ่ม/แก้ไข สินค้า</h1>
<p>
เริ่มแรก ก่อนที่จะเพิ่มสินค้า เราต้องทำความเข้าใจเกี่ยวกับ สินค้า ในระบบเสียก่อน ใน SI สินค้าจะถูกมองเป็น 2 แบบ คือ รุ่นสินค้า หรือ กลุ่มสินค้า และ รายการสินค้า หรือ สินค้าย่อย <br />
<strong style="color:red">รุ่นสินค้า</strong>&nbsp; คือต้นแบบของตัวสินค้า ซึ่งในรุ่นสินค้านั้นๆ จะมี สินค้าอยู่ภายในรุ่นซึ่งอาจแยกตามคุณลักษณะของตัวสินค้า เช่น สินค้ารุ่นนี้มี 2 สี 2 ไซด์ แสดงว่าสินค้ารุ่นนี้ มี 4 ตัวสินค้าที่แตกต่างอยู่ภายใน ยกตัวอย่างเช่น สินค้า  A มีสี แดง และ ดำ มีไซด์ M และ L แสดงว่าสินค้ารุ่นนี้จะมี สินค้า A สีแดง ไซด์ M , A สีแดง ไซด์ L, A สีดำ ไซด์ M, A สีดำ ไซด์ L รวม 4 รายการสินค้า<br />
<strong style="color:red">รายการสินค้า</strong>&nbsp; คือรายการสินค้าที่มีคุณลักษณะอย่างน้อยหนึ่งคุณลักษณะ(ซึ่งใน กลุ่มสินค้าหรือรุ่นสินค้า จะไม่มีคุณลักษณะเลย) เมื่อเราเพิ่มรุ่นสินค้า เราจะต้องเพิ่มรายการสินค้านี้เข้าไปด้วยเสมออย่างน้อย 1 รายการ
</p>
<p>
ขั้นตอนการเพิ่มสินค้าจะเริ่มจาก  เพิ่มรุ่นสินค้าและรายละเอียดสินค้า -> เพิ่มรูปภาพสินค้า -> เพิ่มรายการสินค้า  ซึ่งวิธีการมีดังนี้
</p>
<h2>เพิ่มรุ่นสินค้า</h2>
<p>
<img class="pic" src="images/invent/1.4.0.png"  /> <br />
<img class="pic" src="images/invent/1.4.1.png"  /> <br />
<img class="pic" src="images/invent/1.4.2.png"  /> <br />
<img class="pic" src="images/invent/1.4.3.png"  /> <br />
<img class="pic" src="images/invent/1.4.4.png"  /> <br />
</p>

<h2>เพิ่มรูปภาพ</h2>
<p>
เมื่อเพิ่มเราเพิ่มข้อมูลรุ่นสินค้าเรียบร้อยแล้ว หลังจากคลิก บันทึก จะกลับสู่หน้าหลักสินค้า ซึ่งเราจะพบกับรายการสินค้าที่เราเพิ่งเพิ่มเข้าไปดังรูปด้านล่าง ขั้นตอนต่อไปเราจะทำการเพิ่มรูปภาพเพื่อใช้เชื่อมโยงกับสินค้า
ซึ่งวิธีการมีดังนี้
</p>
<p>
<img class="pic" src="images/invent/1.4.5.png"  /> <br />
<img class="pic" src="images/invent/1.4.6.png"  /> <br />
<img class="pic" src="images/invent/1.4.7.png"  /> <br />
<img class="pic" src="images/invent/1.4.8.png"  /> <br />
<img class="pic" src="images/invent/1.4.9.png"  /> <br />
<img class="pic" src="images/invent/1.5.0.png"  /> <br />
</p>
<h2>เพิ่มรายการสินค้า</h2>
<p>
การเพิ่มรายการสินค้า มี 2 วิธี คือ เพิ่มทีละรายการ และ การใช้ตัวสร้างรายการอัตโนมัติ แล้วกลับมาแก้ไขรายละเอียด
</p>
<p>&nbsp;</p>
<h3 style="margin-left:20px;"><u>เพิ่มทีละรายการ</u></h3>
<p>
<img class="pic" src="images/invent/1.5.1.png"  /> <br />
<img class="pic" src="images/invent/1.5.2.png"  /> <br />
<img class="pic" src="images/invent/1.5.3.png"  /> <br />
</p>
<p>
3. กำหนดรหัสอ้างอิงสินค้ารายการนี้ ในรูปตัวอย่าง กำหนดจาก รหัสรุ่น(KFB-S082)-รหัสสี(AL)-รหัสไซด์(M) ซึ่งรหัสอ้างอิงนี้ไม่สามารถกำหนดซ้ำกันได้<br />
4. เลืกกำนหดสีให้ตรงกับสินค้า (ถ้ามี)<br />
5. เลืกกำนหดไซด์ให้ตรงกับสินค้า (ถ้ามี)<br />
6. เลืกกำนหดคุณลักษณะให้ตรงกับสินค้า (ถ้ามี)<br />
7. กำหนดบาร์โค้ดให้สินค้า (ถ้ามี)<br />
8. กำหนดบาร์โค้ดของแพ็คสินค้า (ถ้ามี)<br />
9. ใส่จำนวนในแพ็คสินค้า (ถ้ามี)<br />
10. ใส่ราคาทุนของสินค้าโดยราคาทุนเริ่มต้นจะถูกดึงมาจากราคาที่เราใส่ไว้ตอนเพิ่มรุ่นสินค้า หากราคาไม่เท่ากันให้เรากำหนดใหม่ (บางกรณีต่างไซด์ราคาอาจต่างกัน) หากไม่มีราคาทุนให้กำหนดเป็น 0.00<br />
11. ใส่ราคาขายของสินค้าโดยราคาขายเริ่มต้นจะถูกดึงมาจากราคาที่เราใส่ไว้ตอนเพิ่มรุ่นสินค้า หากราคาไม่เท่ากันให้เรากำหนดใหม่ (บางกรณีต่างไซด์ราคาอาจต่างกัน) หากไม่มีราคาขายให้กำหนดเป็น 0.00<br />
12 - 15  ใส่น้ำหนัก, ความกว้าง, ความยาว, ความสูง ของสินค้า โดยค่าเริ่มต้นคือค่าที่เรากำหนดไว้ตอนเพิ่มรุ่นสินค้า หากต่างกันให้เรากำหนดใหม่ (ต่างไซด์น้ำหนัก, ความกว้าง, ความยาว, ความสูง ย่อมต่างกัน๗ หากไม่มีให้กำหนดเป็น 0.00<br />
16. เลือกรูปภาพให้ตรงกับสินค้า<br />
17. บันทึก<br />
ทำซ้ำขั้นตอนที่ 3 - 17 จนครบทึกรายการสินค้าในรุ่นนี้<br />
</p>
<p>&nbsp;</p>
<h3 style="margin-left:20px;"><u>ใช้ตัวสร้างอัตโนมัติ</u></h3>
<p>
<img class="pic" src="images/invent/1.5.1.png"  /> <br />
<img class="pic" src="images/invent/1.5.2.png"  /> <br />
<img class="pic" src="images/invent/1.5.4.png"  /> <br />
<img class="pic" src="images/invent/1.5.5.png"  /> <br />
<img class="pic" src="images/invent/1.5.6.png"  /> <br />
</p>
<p>
เมื่อสร้างรายการเสร็จแล้วเราอาจจะต้องมากำหนด บาร์โค้ดสินค้า บาร์โค้ดแพ็คสินค้า อีกทีดังนี้
</p>
<p>
<img class="pic" src="images/invent/1.5.7.png"  /> <br />
<img class="pic" src="images/invent/1.5.8.png"  /> <br />
</p>
<p>
กรณีที่มีการใช้งานแพ็คสินค้า ให้เราทำการกำหนดบาร์โค้ดแพ็คสินค้าและจำนวนในแพ็คสินค้า โดยคลิกที่ปุ่มแก้ไขบาร์โค้ดแพ็ค แล้วทำซ้ำขั้นตอนที่ 12 - 13 และคลิกปุ่ม แก้ไขจำนวนในแพ็ค แล้วทำซ้ำขั้นตอนที่ 12-13 จนครบทุกรายการ
</p>
<h2></h2>
<p style="width:100%; text-align:center">
หัวข้อก่อนหน้า : <a href="index.php?content=category">เพิ่ม/แก้ไข หมวดหมู่สินค้า</a>&nbsp;&nbsp; | &nbsp;&nbsp;  <a href="#top">ขึ้นบน</a>&nbsp;&nbsp; | &nbsp;&nbsp; หัวข้อถัดไป : <a href="index.php?content=customer_group">เพิ่ม/แก้ไข กลุ่มลูกค้า</a>
</p>