<h1>สร้างโปรไฟล์</h1>
<p>
<strong>"โปรไฟล์"</strong> คือ วิธีการเชื่อมโยงระหว่าง ผู้ใช้งาน กับ สิทธิ์การใช้งาน โดยผู้ดูแลระบบจะสร้างโปรไฟล์ขี้นมาแล้วจึงกำหนดสิทธิ์ให้กับโปรไฟล์นั้นๆ แล้วเชื่อมโยงผู้ใช้งานกับโปรไฟล์อีกทีเพื่อเป็นการกำหนดสิทธิ์ให้กับผู้ใช้งาน โดยโปรไฟล์หนึ่งโปรไฟล์ สามารถถูกกำหนดให้กับพนักงานกี่คนก็ได้ เช่น ผู้ดูแลระบบ สร้างโปรไฟล์พนักงานคลังสินค้า และกำหนดสิทธิ์ให้กับโปรไฟล์นี้ให้เข้าถึงข้อมูลและใช้งานได้เฉพาะขอบเขตที่รับผิดชอบของคลังสินค้าเท่านั้น จากนั้นก็เชื่อมโยงโปรไฟล์นี้กับผู้ใช้ที่ทำหน้าที่ ดูแลคลังสินค้าทุกคน ทำให้ไม่ต้องกำหนดสิทธิ์ซ้ำๆหลายครั้ง ซึ่งวิธีการสร้างโปรไฟล์มีดังนี้
</p>
<p>&nbsp;</p>
<p>
<img src="images/invent/1.0.4.jpg" width="70%" style="margin-top:15px; margin-bottom:15px; border:solid 1px #CCC" /> <br>
<img src="images/invent/1.0.5.jpg" width="70%" style="margin-top:15px; margin-bottom:15px; border:solid 1px #CCC" /> <br>
<img src="images/invent/1.0.6.jpg" width="70%" style="margin-top:15px; margin-bottom:15px; border:solid 1px #CCC" /> <br>
1. เลือกเมนู กำหนดค่า <br>
2. เลือกเมนู โปรไฟล์ <br>
3. คลิก เพิ่มโปรไฟล์ <br>
4. กำหนดชื่อ <br>
5. บันทึก <br>
</p>

<h2></h2>
<p style="width:100%; text-align:center">
หัวข้อก่อนหน้า : <a href="index.php?content=pre_data">การเตรียมข้อมูล สำหรับเริ่มต้นระบบ</a>&nbsp;&nbsp; | &nbsp;&nbsp;  <a href="#top">ขึ้นบน</a>&nbsp;&nbsp; | &nbsp;&nbsp; หัวข้อถัดไป : <a href="index.php?content=permission">กำหนดสิทธิ์</a>
</p>
