<h1>การรับสินค้าเข้า</h1>

<p>
<img class="pic" src="images/invent/1.7.3.png"  /> <br />
<img class="pic" src="images/invent/1.7.4.png"  /> <br />
<img class="pic" src="images/invent/1.7.5.png"  /> <br />
3. เลขที่เอกสารจะรันอัตโนมัติ ซึ่งเลขที่เอกสารที่เห็นตอนนี้ อาจไม่ใช่เลขที่เอกสารจริงเพราะหากมีคนอื่นเปิดเอกสารเดียวกันแล้วบันทึกรายการก่อนก็จะได้ลำดับของเลขที่เอกสารก่อน<br />
4. ใส่เลขที่อ้างอิงการรับสินค้าเข้า เช่น เลขที่ใบสั่งซื้อ หรือ Lot ที่สั่งซื้อ<br />
5. กำหนดวันที่ที่รับสินค้าเข้า ซึ่งค่าเริ่มต้นคือวันที่ปัจจุบัน<br />
6. กำหนดวัตถุประสงค์การรับสินค้าเข้า ซึ่งมี 2 ตัวเลือก คือ รับเข้าปกติ หมายถึง การรับสินค้าจากการสั่งซื้อสินค้าทั่วไป และ รับเข้าจากการแปรรูป หมายถึง มีการเบิกสินค้าออกไปเพื่อเปลี่ยนเป็นสินค้าอีกตัวและรับกลับเข้ามา<br />
7. คลิกปุ่ม รับสินค้าเข้า เพื่อบันทึกรายการ<br />
<img class="pic" src="images/invent/1.7.6.png"  /> <br />
8. เลือกคลังสินค้าที่จะรับสินค้าเข้า<br />
9. ยิงบาร์โค้ดโซนในช่อง บาร์โค้ดโซน หรือ พิมพ์ชื่อโซนในช่อง ชื่อโซน แล้วกด Enter <br />
10. ใส่จำนวนสินค้าในรายการที่จะรับเข้า<br />
11. ยิงบาร์โค้ดสินค้า หรือ พิมพ์บาร์โค้ดสินค้าแล้วกด Enter<br />
<img class="pic" src="images/invent/1.7.7.png"  /> <br />
12. คลิกปุ่ม เปลี่ยนโซน หรือ กดปุ่ม F2 บนแป้นพิมพ์ หากต้องการเปลี่ยนโซนรับสินค้าเข้าในรายการต่อไป แล้วทำซ้ำขั้นตอนที่ 9 - 11 หากไม่ต้องการเปลี่ยนโซน ให้ทำซ้ำขั้นตอนที่ 10 - 11 จนกว่าจะรับสินค้าครบทุกรายการ<br />
13. หากมีการรับสินค้าเข้าผิดโซนหรือเกิดข้อผิดพลาดกับสินค้ารายการใด สามารถ คลิกปุ่ม Delete รูปถังขยะ เพื่อลบรายการนั้นแล้วทำการรับเข้ารายการที่ลบใหม่<br />
14. กรณีที่การรับสินค้าเข้ายังไม่เสร็จสมบูรณ์ หรือ เรายังไม่ต้องการให้ยอดสินค้าเข้าไปในสต็อก เราสามารถคลิกปุ่ม กลับ เพื่อออกจากการรับสินค้า ระบบจะเก็บรายการที่เราทำไว้ แต่จะไม่เพิ่มยอดสต็อก จนกว่าเราจะกลับมาคลิกปุ่ม บันทึก ระบบจึงจะทำการเพิ่มยอดสินค้าเข้าสต็อกให้ <br />
15. หากเรารับสินค้าครบถ้วนแล้ว คลิกปุ่ม บันทึก เพื่อเพิ่มยอดสินค้าเข้าสต็อก<br />
</p>
<h2>การกลับมาเพิ่มหรือแก้ไขรายการ</h2>
<p>
กรณีที่เราต้องกลับมาแก้ไขรายการรับสินค้าเข้า สามารถทำได้โดยเลือกเมนู คลังสินค้า > รับสินค้าเข้า แล้วคลิกปุ่มแก้ไข รูปดินสอ สีเหลือง เพื่อแก้ไขรายการที่ต้องการ โดยเราสามารถแก้ไขรายการรับสินค้าเข้าได้ โดยการทำซ้ำขั้นตอนที่ 8 - 12 จนกว่าจะครบแล้วบันทึก หรือ เปลี่ยนเลขที่อ้างอิง วันที่ และวัตถุประสงค์การรับเข้า ในส่วนของหัวเอกสารโดยทำตามขั้นตอนต่อไปนี้<br />
<img class="pic" src="images/invent/1.7.8.png" /><br />
<img class="pic" src="images/invent/1.7.9.png" /><br />
<img class="pic" src="images/invent/1.8.0.png" /><br />
</p>
<h2></h2>
<p style="width:100%; text-align:center">
หัวข้อก่อนหน้า : <a href="index.php?content=setting">กำหนดค่าต่างๆ</a>&nbsp;&nbsp; | &nbsp;&nbsp;  <a href="#top">ขึ้นบน</a>&nbsp;&nbsp; | &nbsp;&nbsp; หัวข้อถัดไป : <a href="index.php?content=return_product">การรับคืนสินค้า</a>
</p>