<h1>การเบิกสินค้า</h1>
<p>
การเบิกสินค้า หมายถึง การนำสินค้าออกจากคลังโดยไม่เกิดยอดขาย ซึ่งเกิดขึ้นได้หลายกรณี เช่น เบิกเพื่อนำไปใช้ในการส่งเสริมการขาย เบิกไปใช้เป็นตัวอย่าง เบิกไปใช้งานอื่นๆ <br />
ซึ่งการเบิกจะช่วยให้การคุมสต็อกเป็นได้ด้วยความเรียบร้อยเพราะระบบจะส่งต่อการเบิกให้กับเจ้าหน้าที่คลังสินค้าเพื่อดำเนินการจัดเตรียมสินค้า ตรวจสินค้า และ เปิดบิล เพื่อตัดยอดสินค้าจากสต็อกได้อย่างถูกต้อง ซึ่งวิธีการเบิกสินค้ามีดังนี้
</p>
<p>
<img class="pic" src="images/invent/1.8.6.png" /><br />
1. ที่เมนูหลัก เลือกเมนู คลังสินค้า ->เบิกสินค้า<br />
<img class="pic" src="images/invent/1.8.7.png" /><br />
2. ที่หน้าหลักการเบิกสินค้า คลิกปุ่ม เบิกสินค้า <br />
<img class="pic" src="images/invent/1.8.8.png" /><br />
3. กำหนดวันที่เบิกสินค้าโดยคลิกที่ช่องวันที่แล้วเลือกวันที่จากปฏิทิน<br />
4. กำหนดชื่อผู้เบิกสินค้า โดยพิมพ์ชื่อแล้วเลือกจากรายชื่อที่ปรากฏขึ้นมา หากไม่มีรายชื่อที่ต้องการปรากฏขี้นมา แสดงว่าไม่มีพนักงานนี้อยู่ในระบบ ให้ทำการเพิ่มพนักงานที่เมนู กำหนดค่า ->พนักงาน แล้วจึงกลับมาทำต่อ <a href="index.php?content=employee" target="_blank">คลิกเพื่อดูวิธีการเพิ่มพนักงาน</a><br />
5. เลือกวัตถุประสงค์ของการเบิก ซึ่งมี 2 ตัวเลือกคือ เบิกเพื่อใช้งาน และ เบิกเพื่อแปรรูป<br />
6. กำหนดชื่อลูกค้าเพื่ออ้างอิง (ถ้าต้องการอ้างอิง) โดยพิมพ์ชื่อแล้วเลือกจากรายชื่อที่ปรากฏขึ้นมา หากไม่มีรายชื่อที่ต้องการปรากฏขึ้นมา แสดงว่าไม่มีชื่อลูกค้านี้อยู่ในระบบ ให้ทำการเพิ่มชื่อลูกค้าที่เมนู ลูกค้า -> ลูกค้า แล้วจึงกลับมาทำต่อ <a href="index.php?content=customer" target="_blank">คลิกเพื่อดูวิธีการเพิ่มลูกค้า</a><br />
7. ใส่หมายเหตุสำหรับการเบิกครั้งนี้ (ถ้ามี)<br />
8. คลิกปุ่มเพิ่มเพื่อเพิ่มเอกสารการเบิกสินค้า<br />
<img class="pic" src="images/invent/1.8.9.png" /><br />
9. ระบบจะแบ่งสินค้าไว้เป็น แท็บตามหมวดหมู่ คลิกเลือกหมวดหมู่สินค้าที่ต้องการเบิก<br />
10. คลิกเลือกสินค้าที่ต้องการเบิกที่รูปสินค้า<br />
<img class="pic" src="images/invent/1.9.0.png" /><br />
11. หลังจากคลิกรูปสินค้าระบบจะดึงข้อมูลสินค้าและยอดสินค้าคงเหลือมาแสดงในรูปแบบตาราง ให้ท่านใส่จำนวนที่ต้องการเบิกในช่องจำนวนซึ่งสามารถใส่ได้สูงสุดไม่เกินจำนวนที่ปรากฏอยู่ใต้ช่องใส่จำนวน(จำนวนสต็อกคงเหลือ) โดยใส่เฉพาะรายการที่ต้องการหากรายการไหนไม่ต้องการไม่จำเป็นต้องใส่<br />
12. คลิกปุ่ม เพิ่มในรายการเพื่อเพิ่มรายการที่เลือกลงในเอกสาร<br />
<img class="pic" src="images/invent/1.9.1.png" /><br />
13. ทำซ้ำขั้นตอนที่ 9 - 12 จนกว่าจะได้สินค้าที่ต้องการจนครบ จากนั้นคลิกปุ่มบันทึกด้านบนเพื่อบันทึกเอกสาร<br />
<img class="pic" src="images/invent/1.9.2.png" /><br />
14. เมื่อบันทึกเอกสารแล้ว จะกลายเป็นออเดอร์รอจัดสินค้าเพื่อให้เจ้าหน้าที่คลังสินค้าดำเนินการจัดสินค้า และ ตรวจสินค้าต่อไป ผู้เบิกสามารถรับสินค้าได้เมื่อมีการจัดสินค้า ตรวจสินค้า และเปิดบิลเรียบร้อยแล้ว<br />
</p>


<h2></h2>
<p style="width:100%; text-align:center">
หัวข้อก่อนหน้า : <a href="index.php?content=retrun_product">รับคืนสินค้า</a>&nbsp;&nbsp; | &nbsp;&nbsp;  <a href="#top">ขึ้นบน</a>&nbsp;&nbsp; | &nbsp;&nbsp; หัวข้อถัดไป : <a href="index.php?content=lend">การยืมสินค้า</a>
</p>