<h1>เพิ่ม/แก้ไข ไซด์</h1>
<p>
สินค้าแต่ละตัวจะมีคุณลักษณะต่างๆ เช่น สี ไซด์ ความกว้าง ความยาว ความสูง เป็นต้น แต่ด้วยระบบถูกออกแบบมาเพื่อใช้กับเสื้อผ้าโดยเฉพาะ จึงมีคุณลักษณะสำคัญหลักๆ อยู่ 2 อย่างคือ สี และ ไซด์  ที่เหลือจะอยู่ในส่วนคุณลักษณะอื่นๆ สำหรับการเริ่มต้นระบบใหม่ เราจะต้องทำการ กำหนดไซด์ไว้ก่อน เพราะในขั้นตอนการเพิ่มข้อมูลสินค้า เราจะต้องระบุไซด์ให้กับสินค้าเพิ่มเข้าไปใหม่(หากสินค้านั้นมีไซด์) การเพิ่มไซด์ทำได้ดังนี้
</p>

<p>
<img class="pic" src="images/invent/1.2.8.png"  /> <br />
<img class="pic" src="images/invent/1.2.9.png"  /> <br />
<img class="pic" src="images/invent/1.3.1.png"  /> <br />
</p>
<p>&nbsp;</p>

<h2></h2>
<p style="width:100%; text-align:center">
หัวข้อก่อนหน้า : <a href="index.php?content=color">เพิ่ม/แก้ไข สี</a>&nbsp;&nbsp; | &nbsp;&nbsp;  <a href="#top">ขึ้นบน</a>&nbsp;&nbsp; | &nbsp;&nbsp; หัวข้อถัดไป : <a href="index.php?content=attribute">เพิ่ม/แก้ไข คุณลักษณะ</a>
</p>