<h1>การโอนสินค้าระหว่างคลัง</h1>
<p>
การโอนสินค้าระหว่างคลัง คือ การย้ายสินค้า จากคลังหนึ่งไปเก็บไว้อีกคลังหนึ่ง เพื่อบริหารจัดการสต็อกสินค้า เช่น โอนจากคลังสำรองเข้าคลังหลักเป็นต้น การโอนสินค้าระหว่างคลังทำได้ดังนี้
</p>
<p>
<img class="pic" src="images/invent/2.1.1.png" /><br />
1. ที่เมนูหลัก เลือกเมนู คลังสินค้า -> โอนคลัง<br />
<img class="pic" src="images/invent/2.1.2.png" /><br />
2. คลิกปุ่ม โอนคลัง เพื่อเพิมเอกสารการโอนคลัง<br />
<img class="pic" src="images/invent/2.1.3.png" /><br />
3. กำหนดวันที่เอกสาร<br />
4. ระบุคลังต้นทางที่ต้องการย้ายสินค้าออก<br />
5. ระบุคลังปลายทางที่ต้องการย้ายสินค้าเข้า<br />
6. ใส่หมายเหตุ(ถ้ามี)<br />
7. คลิกปุ่มเพิ่มเพื่อบันทึกเอกสาร<br />
<img class="pic" src="images/invent/2.1.4.png" /><br />
8. คลิกปุ่ม ย้ายสินค้าออก เพื่อเลือกโซนและสินค้าที่จะย้ายออกจากคลัง<br />
<img class="pic" src="images/invent/2.1.5.png" /><br />
9. ใส่ชื่อโซนที่ต้องการย้ายสินค้าออกแล้วคลิกตกลง หรือ ยิงบาร์โค้ดโซนที่จะย้ายสินค้าออก (ซึ่งโซนที่ระบุต้องเป็นโซนที่อยู่ในคลังต้นทางเท่านั้น)<br />
<img class="pic" src="images/invent/2.1.6.png" /><br />
<img class="pic" src="images/invent/2.1.7.png" /><br />
10. ใส่จำนวนสินค้าที่ต้องการย้ายออก<br />
11. ยิงบาร์โค้ดสินค้าที่ต้องการย้ายออก<br />
(ท่านสามารถ เปลี่ยนโซนสินค้าที่จะย้ายออกได้โดยการ คลิกปุ่ม โซนใหม่หรือกดปุ่ F2 บนคีย์บอร์ด แล้วทำขั้นตอนที่ 9 - 11 จนกว่าจะได้สินค้าที่ต้องการย้ายจนครบทุกรายการ)<br />
(กรณี ที่ต้องการย้ายสินค้าทั้งหมดในโซนที่เลือก ให้ท่านคลิกเลือกช่อง ย้ายทั้งหมด จะมีปุ่ม ดำเนินการย้ายปรากฏขึ้นมา ให้ท่านคลิกปุ่มดำเนินการย้ายเพื่อดำเนินการต่อไป)<br />
<img class="pic" src="images/invent/2.1.8.png" /><br />
12. เมื่อท่าน ย้ายสินค้าออกจากโซนต้นทางซึ่งอยู่ในคลังต้นทางเรียบร้อยแล้ว ให้ท่านทำการคลิกปุ่ม สินค้าที่ย้ายเพื่อแสดงรายการสินค้าที่ท่านย้ายออกมา เพื่อดำเนินการย้ายเข้าคลังและโซนปลายทางต่อไป<br />
<img class="pic" src="images/invent/2.1.9.png" /><br />
13. หน้านี้จะแสดงรายการสินค้าที่ท่านได้ย้ายออกจากโซนและคลังต้นทาง ให้ท่านคลิกที่ไอคอนสีเขียวในช่อง ไปที่ เพื่อเลือกโซนปลายทางที่จะย้ายเข้าในแต่ละรายการสินค้า<br />
<img class="pic" src="images/invent/2.2.0.png" /><br />
14. ใส่ชื่อโซนปลายทางที่จะย้ายสินค้าเข้าแล้วคลิกตกลง หรือ ยิงบาร์โค้ดโซนปลายทาง ซึ่งต้องเป็นโซนที่อยู่ในคลังปลายทางที่ท่านได้กำหนดไว้ตอนเพิ่มเอกสาร<br />
<img class="pic" src="images/invent/2.2.1.png" /><br />


</p>


<h2></h2>
<p style="width:100%; text-align:center">
หัวข้อก่อนหน้า : <a href="index.php?content=move_zone">การย้ายพื้นที่จัดเก็บสินค้า</a>&nbsp;&nbsp; | &nbsp;&nbsp;  <a href="#top">ขึ้นบน</a>&nbsp;&nbsp; | &nbsp;&nbsp; หัวข้อถัดไป : <a href="index.php?content=check_zone">การตรวจนับสินค้า(เปรียบเทียบยอด)</a>
</p>