<h1>เพิ่ม/แก้ไข คลังสินค้า</h1>
<p>
ระบบมีคลังเริ่มต้นมาให้ 2 คลัง คือ คลังหลักและคลังฝากขาย ท่านสามารถเปลี่ยนชื่อคลังได้ แต่ไม่สามารถลบคลังเริ่มต้นได้ โดยคลังเริ่มต้นทั้ง 2 คลังมีบทบาทต่างกัน คือ <br />
- คลังหลัก มีหน้าที่เป็นคลังขายปกติ สินค้าที่เก็บไว้ในคลังนี้จะสามารถมองเห็นและสั่งซื้อได้โดยพนักงานขาย (จาก Sale page)  และ โดยลูกค้าที่ลงทะเบียนไว้ ( Front-end ) และคลังที่ถูกเพิ่มเข้ามาใหม่ทั้งหมดจะมีบทบาทเหมือนคลังหลัก<br />
- คลักฝากขาย มีหน้าที่เป็นคลังที่เก็บสินค้าสำหรับฝากขาย (อาจเก็บแค่ยอดสินค้า) ซึ่งสินค้าในคลังนี้อาจจะไม่ได้อยู่ในคลังจริง เพราะว่าถูกนำไปฝากขายที่อื่น แต่จะมียอดจำนวนสินค้าเก็บไว้ในคลังนี้ ซึ่งสินค้าจะถูกตัดยอดออกจากคลังเมื่อขายได้ โดยเอกสาร <a href="#">ตัดยอดฝากขาย</a> ส่วนการแบ่งแต่ละพื้นที่ฝากขาย จะใช้การเพิ่ม โซนสินค้าฝากขายเพื่อเป็นตัวแยกสต็อกแต่ละจุดขาย การเพิ่มคลังสินค้า มีขั้นตอนดั้งนี้
</p>
<p>&nbsp;</p>
<p>
<img class="pic" src="images/invent/1.1.6.png"  /> <br>
<img class="pic" src="images/invent/1.1.7.png"  /> <br>
<img class="pic" src="images/invent/1.1.8.png"  /> <br>

</p>

<h2></h2>
<p style="width:100%; text-align:center">
หัวข้อก่อนหน้า : <a href="index.php?content=sale">เพิ่ม/แก้ไข พนักงานขาย</a>&nbsp;&nbsp; | &nbsp;&nbsp;  <a href="#top">ขึ้นบน</a>&nbsp;&nbsp; | &nbsp;&nbsp; หัวข้อถัดไป : <a href="index.php?content=zone">เพิ่ม/แก้ไข โซนสินค้า</a>
</p>